ikok07/stm32-f401-cmake-template/src/main.c
#include <clock_driver.h>
#include <flash_driver.h>

void SystemInit() {
    // HCLK - 64MHz; APB1 - 32 MHz; APB2 - 32 MHz

    CLOCK_SelectSysClock(CLOCK_SysClockHSI);
    CLOCK_Disable(CLOCK_SrcPLL);
    FLASH_SetLatency(FLASH_WaitState1);
    CLOCK_SetPLLFactors(8, 128, CLOCK_PLLSysClkPresc4);
    CLOCK_Enable(CLOCK_SrcPLL);
    CLOCK_SelectSysClock(CLOCK_SysClockPLL);
    CLOCK_SetAHBBusPrescaler(CLOCK_AHBPresc1);
    CLOCK_SetAPBBusPrescaler(CLOCK_BusAPB1, CLOCK_APBPresc2);
    CLOCK_SetAPBBusPrescaler(CLOCK_BusAPB2, CLOCK_APBPresc2);
}

#include <i2c_driver.h>
#include <string.h>

#include "stm32f4xx.h"
#include "gpio_driver.h"

/*
 * I2C GPIOs:
 * SDA      =>  PB7
 * SCL      =>  PB8
*/

#define LED_PIN             13
#define BTN_PIN             0

#define I2C_SDA             7
#define I2C_SCL             8

#define SLAVE_ADDR          0x03

volatile uint8_t button_trigger = 0;

int main(void) {
    GPIO_Handle_t gpioHandle = {
        .pGPIOx = GPIOC,
        .GPIO_PinConfig = {
            .GPIO_PinNumber = LED_PIN,
            .GPIO_PinMode = GPIO_ModeOutput,
            .GPIO_PinOPType = GPIO_OpTypePP,
            .GPIO_PinPuPdControl = GPIO_NoPuPd,
            .GPIO_PinSpeed = GPIO_SpeedHigh
        }
    };

    I2C_Handle_t i2cHandle = {
        .pI2Cx = I2C1,
        .I2C_Config = {
            .I2C_SCLSpeed = I2C_SclSpeedSM,
            .I2C_DeviceAddressLen = I2C_DeviceAddr7Bits,
            .I2C_DeviceAddress = 0x01,
            .I2C_FMDutyCycle = I2C_FmDuty2
        }
    };

    // Init the LED
    GPIO_Init(&gpioHandle);

    // Init the BTN
    gpioHandle.pGPIOx = GPIOA;
    gpioHandle.GPIO_PinConfig.GPIO_PinNumber = BTN_PIN;
    gpioHandle.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_Pu;
    gpioHandle.GPIO_PinConfig.GPIO_PinMode = GPIO_ModeInputFEdge;
    GPIO_Init(&gpioHandle);
    GPIO_IRQConfig(BTN_PIN, 1, ENABLE);

    // Init I2C SCL
    gpioHandle.pGPIOx = GPIOB;
    gpioHandle.GPIO_PinConfig.GPIO_PinNumber = I2C_SCL;
    gpioHandle.GPIO_PinConfig.GPIO_PinMode = GPIO_ModeAlternate;
    gpioHandle.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NoPuPd;
    gpioHandle.GPIO_PinConfig.GPIO_PinOPType = GPIO_OpTypeOD;
    gpioHandle.GPIO_PinConfig.GPIO_PinAltFunMode = GPIO_AF4;
    GPIO_Init(&gpioHandle);

    // Init I2C SDA
    gpioHandle.GPIO_PinConfig.GPIO_PinNumber = I2C_SDA;
    GPIO_Init(&gpioHandle);

    // Init I2C
    I2C_PeriClockControl(i2cHandle.pI2Cx, ENABLE);
    I2C_Init(&i2cHandle);

    while (1) {
        if (button_trigger) {
            // Small delay because of debouncing
            for (int i = 0; i < 1000000; i++);

            // uint8_t tx_data[16] = "Hello, World!";
            uint8_t command = 0x51;
            uint8_t length = 0;

            I2C_PeripheralControl(i2cHandle.pI2Cx, ENABLE);

            // Get the length
            I2C_MasterSendData(&i2cHandle, &command, sizeof(command), SLAVE_ADDR, I2C_StopDisabled);
            I2C_MasterReceiveData(&i2cHandle, &length, sizeof(length), SLAVE_ADDR, I2C_StopDisabled);

            // Receive the data
            uint8_t rx_data[length];
            if (length > 0) {
                command = 0x52;
                I2C_MasterSendData(&i2cHandle, &command, sizeof(command), SLAVE_ADDR, I2C_StopDisabled);
                I2C_MasterReceiveData(&i2cHandle, rx_data, sizeof(rx_data), SLAVE_ADDR, I2C_StopEnabled);
            }

            if (rx_data[3] == 4) GPIO_ToggleOutputPin(GPIOC, LED_PIN);

            I2C_PeripheralControl(i2cHandle.pI2Cx, DISABLE);
            button_trigger = 0;
        }
    };
}

void EXTI0_IRQHandler() {
    GPIO_IRQHandling(BTN_PIN);
    button_trigger = 1;
}
